RAFHA2413/Control_Navegacion_USV_STM32H562VGT6_v03/Core/Src/main.c
/*
 * AUTOPRUEBA PB2:
 * Al arrancar, el LED cambia de estado durante 300 ms y vuelve al estado inicial.
 * Si este destello no se ve, el problema esta en PB2/LED y no en la UART.
 */
HAL_GPIO_WritePin(
    LED_RX_TIERRA_GPIO_Port,
    LED_RX_TIERRA_Pin,
    GPIO_PIN_SET);
HAL_Delay(300U);

HAL_GPIO_WritePin(
    LED_RX_TIERRA_GPIO_Port,
    LED_RX_TIERRA_Pin,
    GPIO_PIN_RESET);
HAL_Delay(300U);

// Inicializa la señal PWM en el pin PB0 (SERVO_CAMARA)
SERVO_init(&SERVO1);
SERVO_ANG(&SERVO1, 0.0f); // Posiciona inicialmente la cámara al centro (0°)
uartRX_it_idle_dma_init(&UARTRX1);

// Inicializa la telemetria oficial $PUSVD por USART1 / XBee
TELEMETRIA_USV_init(&TELEMETRIA1);

// Inicializa BNO085
imu_ok = IMU_Init();
imu_addr = IMU_GetAddress7bit();
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* Lectura IMU cada 50 ms */
   if ((HAL_GetTick() - imu_last_ms) >= 50U)
    {
        imu_last_ms = HAL_GetTick();

        if (IMU_ReadEuler(
                &imu_roll,
                &imu_pitch,
                &imu_yaw) != 0U)
        {
            imu_data_ok = 1U;

            /* Carga yaw, pitch y roll reales en la estructura $PUSVD. */
            USV_ActualizarTelemetriaIMU(
                imu_roll,
                imu_pitch,
                imu_yaw);
        }
    }

    /* Envio a Teleplot cada 200 ms.
     * USART6 queda exclusivamente para diagnostico/IMU y no interfiere
     * con USART1, que se usa para los XBee.
     */
    if ((HAL_GetTick() - teleplot_last_ms) >= 200U)
    {
        teleplot_last_ms = HAL_GetTick();

        int len = snprintf(
            teleplot_tx,
            sizeof(teleplot_tx),
            ">imu_ok:%u\r\n"
            ">imu_addr:%u\r\n"
            ">imu_data_ok:%u\r\n"
            ">roll:%.2f\r\n"
            ">pitch:%.2f\r\n"
            ">yaw:%.2f\r\n"
            ">rx_eventos:%lu\r\n"
            ">pusvu_validas:%lu\r\n"
            ">pusvu_invalidas:%lu\r\n"
            ">camara_rx:%d\r\n"
            ">servo_ccr3:%lu\r\n",
            (unsigned int)imu_ok,
            (unsigned int)imu_addr,
            (unsigned int)imu_data_ok,
            imu_roll,
            imu_pitch,
            imu_yaw,
            (unsigned long)rx_eventos_main,
            (unsigned long)pusvu_validas_main,
            (unsigned long)pusvu_invalidas_main,
            (int)camara_rx_main,
            (unsigned long)TIM3->CCR3);

        if (len > 0)
        {
            HAL_UART_Transmit(
                &huart6,
                (uint8_t *)teleplot_tx,
                (uint16_t)len,
                100U);
        }
    }

    // Verifica si USART1 recibio una trama desde Tierra mediante ReceiveToIdle por DMA
    if (UARTRX1.flag_rx == 1)
    {
        uint16_t longitud_rx;

        rx_eventos_main++;
        led_rx_ultimo_evento_ms = HAL_GetTick();
        led_rx_activo = 1U;

        /*
         * La libreria UARTRX entrega la cantidad de bytes en num_datos.
         * Se garantiza terminacion NUL aqui, en main.c, antes de pasar
         * la cadena al decodificador oficial de la trama.
         */
        longitud_rx = UARTRX1.num_datos;

        if (longitud_rx >= UARTRX1.sizeT)
        {
            longitud_rx = UARTRX1.sizeT - 1U;
        }

        UARTRX1.trama_rx[longitud_rx] = '\0';

        /*
         * IMPORTANTE:
         * No se llama procesa_rx(), porque esa funcion de la libreria
         * UARTRX vigente interpreta el formato de prueba "SER=".
         *
         * Para la integracion real se usa la trama oficial $PUSVU:
         * USV_LeerComando() verifica estructura, CRC y los 16 campos.
         */
        if (USV_LeerComando(
                (const char *)UARTRX1.trama_rx,
                &comando_tierra_rx_main) != 0U)
        {
            pusvu_validas_main++;
            camara_rx_main = comando_tierra_rx_main.camara;

            /*
             * Campo 6 de $PUSVU:
             * camara = grados enteros de -90 a +90.
             *
             * SERVO_ANG() ya usa la calibracion validada del MG996R:
             * -90 -> 500 us, 0 -> 1500 us, +90 -> 2500 us.
             */
            SERVO_ANG(
                &SERVO1,
                (float)camara_rx_main);

            /* Indicacion visual de una trama oficial correctamente decodificada. */
            HAL_GPIO_TogglePin(
                LED_GPIO_Port,
                LED_Pin);
        }
        else
        {
            /*
             * Si este contador aumenta, la comunicacion fisica funciona
             * pero existe una diferencia de formato, CRC o escala entre
             * la estacion de tierra y el bote.
             */
            pusvu_invalidas_main++;
        }

        /* Rearma la recepcion DMA para la siguiente trama. */
        uartRX_DMA_Re_init(&UARTRX1);
    }

    /*
     * PRUEBA SOLICITADA POR EL PROFESOR:
     * PB2 parpadea aproximadamente a 2 Hz mientras se siguen recibiendo
     * tramas desde la estacion de tierra.
     */
    if (led_rx_activo != 0U)
    {
        uint32_t ahora_led = HAL_GetTick();

        if ((uint32_t)(ahora_led - led_rx_ultimo_evento_ms) > 400U)
        {
            /* No han llegado tramas recientemente: detiene el parpadeo. */
            led_rx_activo = 0U;
            HAL_GPIO_WritePin(
                LED_RX_TIERRA_GPIO_Port,
                LED_RX_TIERRA_Pin,
                GPIO_PIN_RESET);
        }
        else if ((uint32_t)(ahora_led - led_rx_ultimo_toggle_ms) >= 250U)
        {
            led_rx_ultimo_toggle_ms = ahora_led;

            HAL_GPIO_TogglePin(
                LED_RX_TIERRA_GPIO_Port,
                LED_RX_TIERRA_Pin);
        }
    }

    /* Envia $PUSVD hacia tierra cada 500 ms. */
    TELEMETRIA_USV_Tarea(&TELEMETRIA1);

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

